Tekla Open API Reference for Tekla Structures 2025
PluginBase.CoordinateSystemType Enumeration
 Defines the coordinate system type for model plug-ins which are using points as an input.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum CoordinateSystemType
Public Enumeration CoordinateSystemType
Members
Member name | Value | Description
FROM_FIRST_POINT_AND_GLOBAL | 0 |  Plugin coordinate system is calculated from first input point defining the origin and global coordinates which defines x and y-direction.
FROM_FIRST_AND_SECOND_POINT | 1 |  Plugin coordinate system is calculated from first input point defining the origin and second input point which defines x-direction.
See Also
Reference
Tekla.Structures.Plugins Namespace